Masmiseim36/nxpSDK/boards/twrkv58f220m/bootloader_examples/flashloader/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_InitPins(void)
{

    /* PORTE16 (pin 18) is configured as SPI0_PCS0 */
    PORT_SetPinMux(SPI0_PCS_PORT, SPI0_PCS_PIN, kPORT_MuxAlt2);

    /* PORTE17 (pin 19) is configured as SPI0_SCK */
    PORT_SetPinMux(SPI0_SCK_PORT, SPI0_SCK_PIN, kPORT_MuxAlt2);

    /* PORTE18 (pin 20) is configured as SPI0_SOUT */
    PORT_SetPinMux(SPI0_SOUT_PORT, SPI0_SOUT_PIN, kPORT_MuxAlt2);

    /* PORTE19 (pin 21) is configured as SPI0_SIN */
    PORT_SetPinMux(SPI0_SIN_PORT, SPI0_SIN_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '18', peripheral: ADC0, signal: 'DP, 1', pin_signal: HSADC0A_CH0/ADC0_SE1/ADC0_DP1/PTE16/SPI0_PCS0/UART2_TX/FTM_CLKIN0/FTM0_FLT3}
  - {pin_num: '19', peripheral: ADC0, signal: 'DM, 1', pin_signal: HSADC0A_CH1/ADC0_SE9/ADC0_DM1/PTE17/LLWU_P19/SPI0_SCK/UART2_RX/FTM_CLKIN1/LPTMR0_ALT3}
  - {pin_num: '20', peripheral: ADC0, signal: 'SE, 5a', pin_signal: HSADC0B_CH0/ADC0_SE5a/PTE18/LLWU_P20/SPI0_SOUT/UART2_CTS_b/I2C0_SDA}
  - {pin_num: '21', peripheral: ADC0, signal: 'SE, 6a', pin_signal: HSADC0B_CH1/ADC0_SE6a/PTE19/SPI0_SIN/UART2_RTS_b/I2C0_SCL/CMP3_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_RestoreDefault(void)
{

    /* PORTE16 (pin 18) is configured as ADC0_DP1 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_PCS_PORT, SPI0_RESTOREDEFAULT_PCS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 19) is configured as ADC0_DM1 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SCK_PORT, SPI0_RESTOREDEFAULT_SCK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 20) is configured as ADC0_SE5a */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SOUT_PORT, SPI0_RESTOREDEFAULT_SOUT_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE19 (pin 21) is configured as ADC0_SE6a */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SIN_PORT, SPI0_RESTOREDEFAULT_SIN_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CAN0_InitPins:
- options: {callFromInitBoot: 'false', prefix: CAN0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '96', peripheral: CAN0, signal: RX, pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b/FB_AD16}
  - {pin_num: '95', peripheral: CAN0, signal: TX, pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XB_IN5/FB_AD17}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CAN0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CAN0_InitPins(void)
{

    /* PORTB16 (pin 95) is configured as CAN0_TX */
    PORT_SetPinMux(CAN0_TX_PORT, CAN0_TX_PIN, kPORT_MuxAlt5);

    /* PORTB17 (pin 96) is configured as CAN0_RX */
    PORT_SetPinMux(CAN0_RX_PORT, CAN0_RX_PIN, kPORT_MuxAlt5);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CAN0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '96', peripheral: n/a, signal: disabled, pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b/FB_AD16}
  - {pin_num: '95', peripheral: n/a, signal: disabled, pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XB_IN5/FB_AD17}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CAN0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CAN0_RestoreDefault(void)
{

    /* PORTB16 (pin 95) is disabled */
    PORT_SetPinMux(CAN0_RESTOREDEFAULT_TX_PORT, CAN0_RESTOREDEFAULT_TX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB17 (pin 96) is disabled */
    PORT_SetPinMux(CAN0_RESTOREDEFAULT_RX_PORT, CAN0_RESTOREDEFAULT_RX_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
